Returns true if the use of levelOfDetail is enabled, false if not. The use of levelOfDetail is enabled by calling setLevelOfDetail (with a valid input).
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public bool UseLevelOfDetail()
  Visual Basic
Public Function UseLevelOfDetail As Boolean
  Visual C++
public:
bool UseLevelOfDetail()
 See Also
  SolidOrShellTessellationControls Class
  Autodesk.Revit.DB Namespace